ขั้นตอนการนำเข้าข้อมูลสำหรับ colab
1. การ import library เพื่อการอ่านไฟล์ ใน colab

In [1]:
import files
import os
os.chdir("/Users/phutharesuanwachirapisut/Programming/Dataset")

2. Upload ไฟล์ที่ต้องการอ่าน

In [2]:
# uploaded=files.upload()


การอ่านด้วยฟังก์ชัน read แบบต่างๆ

In [3]:
import pandas as pd
df=pd.read_csv('ex1.csv')
df

   a   b   c   d  message
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12  see you

การอ่านไฟล์โดยใช้ StringIO

In [4]:
import io

In [5]:
sample_df=pd.read_csv('ex1.csv')
sample_df

   a   b   c   d  message
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12  see you

หากต้องการแสดงรายละเอียดของการจัดเก็บข้อมูล ที่ทำการอ่านจากไฟล์สามารถทำได้ดังนี้ ใช้คำสั่ง .info()

In [6]:
sample_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   a        3 non-null      int64
 1   b        3 non-null      int64
 2   c        3 non-null      int64
 3   d        3 non-null      int64
 4   message  3 non-null      object
dtypes: int64(4), object(1)
memory usage: 252.0+ bytes

ตัวอย่าง 2 การอ่านข้อความรูปแบบของไฟล์

In [7]:
s="""
p_id,name,name_en,region,area_km2
กจ,กาญจนบุรี,Kanchanaburi,C,19483.148
กทม,กรุงเทพมหานคร,Bangkok,C,1568.737
จบ,จันทบุรี,Chanthaburi,C,6338.0
ฉช,ฉะเชิงเทรา,Chachengsao,C,5351.0
"""

In [8]:
import pandas as pd
df=pd.read_csv(io.StringIO(s))
df

  p_id           name       name_en region   area_km2
0   กจ      กาญจนบุรี  Kanchanaburi      C  19483.148
1  กทม  กรุงเทพมหานคร       Bangkok      C   1568.737
2   จบ       จันทบุรี   Chanthaburi      C   6338.000
3   ฉช     ฉะเชิงเทรา   Chachengsao      C   5351.000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   p_id      4 non-null      object
 1   name      4 non-null      object
 2   name_en   4 non-null      object
 3   region    4 non-null      object
 4   area_km2  4 non-null      float64
dtypes: float64(1), object(4)
memory usage: 292.0+ bytes

โดยปกติ เมื่อเราอ่านไฟล์ข้อมูลเข้ามา บรรทัดแรกจะถูกกำหนดให้เป็น head หรือ column name เสมอ

In [10]:
# uploaded=files.upload()  #upload ไฟล์ dat1.txt

In [11]:
pd.read_csv('dat1.txt')

   a  b  c  d message
0  1  2  3  4   hello
1  5  6  7  8   world

แต่หากไฟล์ไม่ได้สร้าง head หรือ column name ไว้ก่อน
ให้ทำการกำหนด     header = None

In [12]:
pd.read_csv('dat1.txt',header=None) # head จะกลายเป็น index

   0  1  2  3        4
0  a  b  c  d  message
1  1  2  3  4    hello
2  5  6  7  8    world

ข้อควรระวัง หากไฟล์มี header แต่กำหนด header = None
ข้อมูลของ header จะถูกมองเป็น data ทั่วไป รวมทั้งกรณีกลับกัน

การสร้าง column name/index


เราสามารถกำหนด column name โดยการตั้งชื่อผ่าน names attribute ดังนี้

In [13]:
pd.read_csv('ex2.csv',names=['a','b','c','d','message'])  # สร้าง folder examples ก่อน (คลิกขวา > new folder) แล้ว upload ไฟล์ ex2.csv ไปไว้

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

ถ้าเราต้องการ message column เป็น index_col สำหรับการเข้าถึง row ในการคืนค่าข้อมูลใน DataFrame สามารถกำหนดได้ดังนี้

In [14]:
names=['a','b','c','d','message']

In [15]:
pd.read_csv('ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

การสร้าง Hierarchical index

การกำหนด hierarchical index จาก column names ได้แก่ key1 และ key2

In [16]:
# uploaded=files.upload()  #upload ไฟล์ csv_mindex.csv

In [17]:
parsed=pd.read_csv('csv_mindex.csv')
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [18]:
parsed=pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

การอ่านข้อมูลโดยข้ามบรรทัด ด้วย skiprows attribute

In [19]:
# uploaded=files.upload()  #upload ไฟล์ ex5.csv

In [20]:
pd.read_csv('ex5.csv',skiprows=[0,2,3])

   a   b   c   d  message
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12  see you

การจัดการข้อมูลด้วย na_values attribute

In [21]:
# uploaded=files.upload()  #upload ไฟล์ ex4.csv

In [22]:
result=pd.read_csv('ex4.csv')
result

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8    world
2     three  9  10  11.0  12  see you

In [23]:
result = result.loc[result["something"] == "one"]["a"];result

0    1
Name: a, dtype: int64

In [24]:
pd.notnull(result)

0    True
Name: a, dtype: bool

เมื่อกำหนด na_values = ['NULL']

In [25]:
result=pd.read_csv('ex4.csv',na_values=['NULL'])
result

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8    world
2     three  9  10  11.0  12  see you

In [26]:
sentinels={'message':['see you','NA'],'something':['two']}
pd.read_csv('ex4.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

เราสามารถกำหนดจำนวนบรรทัดที่ต้องการให้อ่าน โดยใช้ nrows attribute ในฟังก์ชัน read

In [27]:
pd.read_csv('ex6.csv',nrows=4)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   B
3  0.204886  1.074134  1.388361 -0.982404   R

เราสามารถกำหนดการอ่านไฟล์เป็นส่วนๆ โดยกำหนดขนาดด้วย chunksize attribute

In [28]:
chunker=pd.read_csv('ex6.csv',chunksize=1000)
chunker

โดยข้อมูลจะเก็บใน TextParser เมื่อจะนำมาใช้งานด้วยการดึงข้อมูลมาเก็บในตัวแปรที่ต้องการใช้งาน เช่น

In [29]:
tot=pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)

tot=tot.sort_values(ascending=False)

In [30]:
tot[:10]

key
B    2
L    1
Q    1
R    1
U    1
V    1
W    1
X    1
Y    1
dtype: object

Data Selection with Indexing

In [31]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101) #ใช้ np.random.RandomState(42) แทนได้โดยไม่ต้องจำหมายเลข seed

In [32]:
arr=np.array([[2.7, 0.6, 0.9,0.5],[0.6, -0.3, -0.8,0.6],[-2.0, 0.7, 0.5,-0.5],[0.1, -0.7, -0.9,0.9],[0.1, 1.9, 2.6,0.6]])

In [33]:
df=pd.DataFrame(arr,index='A B C D E'.split(),columns='W X Y Z'.split())
df

     W    X    Y    Z
A  2.7  0.6  0.9  0.5
B  0.6 -0.3 -0.8  0.6
C -2.0  0.7  0.5 -0.5
D  0.1 -0.7 -0.9  0.9
E  0.1  1.9  2.6  0.6

In [34]:
df['W']

A    2.7
B    0.6
C   -2.0
D    0.1
E    0.1
Name: W, dtype: float64

In [35]:
df[['W','Z']] #Pass a list of column names

     W    Z
A  2.7  0.5
B  0.6  0.6
C -2.0 -0.5
D  0.1  0.9
E  0.1  0.6

Create New Series

In [36]:
df['new']=df['W']+df['Y']
df

     W    X    Y    Z  new
A  2.7  0.6  0.9  0.5  3.6
B  0.6 -0.3 -0.8  0.6 -0.2
C -2.0  0.7  0.5 -0.5 -1.5
D  0.1 -0.7 -0.9  0.9 -0.8
E  0.1  1.9  2.6  0.6  2.7

In [37]:
df['new2']=df['W'].add(df['Y']) #ให้ผลเหมือนคำสั่งด้านบน
df

     W    X    Y    Z  new  new2
A  2.7  0.6  0.9  0.5  3.6   3.6
B  0.6 -0.3 -0.8  0.6 -0.2  -0.2
C -2.0  0.7  0.5 -0.5 -1.5  -1.5
D  0.1 -0.7 -0.9  0.9 -0.8  -0.8
E  0.1  1.9  2.6  0.6  2.7   2.7

Delete Series ด้วยเมธอด Drop

In [38]:
df2=df.drop('new',axis=1)  #ลบ column new จาก df และเก็บไว้ที่ df2 โดยไม่ระบุ inplace
df2

     W    X    Y    Z  new2
A  2.7  0.6  0.9  0.5   3.6
B  0.6 -0.3 -0.8  0.6  -0.2
C -2.0  0.7  0.5 -0.5  -1.5
D  0.1 -0.7 -0.9  0.9  -0.8
E  0.1  1.9  2.6  0.6   2.7

In [39]:
df #Not inplace unless specified  ไม่ได้ลบจาก df ต้นทาง ค่าจึงเหมือนเดิม

     W    X    Y    Z  new  new2
A  2.7  0.6  0.9  0.5  3.6   3.6
B  0.6 -0.3 -0.8  0.6 -0.2  -0.2
C -2.0  0.7  0.5 -0.5 -1.5  -1.5
D  0.1 -0.7 -0.9  0.9 -0.8  -0.8
E  0.1  1.9  2.6  0.6  2.7   2.7

In [40]:
df.drop('new',axis=1,inplace=True) #การลบโดยระบุ inplace = True จะลบข้อมูลนั้นออกจากต้นทาง
df

     W    X    Y    Z  new2
A  2.7  0.6  0.9  0.5   3.6
B  0.6 -0.3 -0.8  0.6  -0.2
C -2.0  0.7  0.5 -0.5  -1.5
D  0.1 -0.7 -0.9  0.9  -0.8
E  0.1  1.9  2.6  0.6   2.7

Delete Series

In [41]:
df.drop('E',axis=0)  #ลบ row ได้จากการกำหนด axis=0  ในที่นี้คือลบ row 'E' เป็น view  เท่านั้นไม่ได้ลบจริงๆ  จนกว่าจะใส่ inplace=True

     W    X    Y    Z  new2
A  2.7  0.6  0.9  0.5   3.6
B  0.6 -0.3 -0.8  0.6  -0.2
C -2.0  0.7  0.5 -0.5  -1.5
D  0.1 -0.7 -0.9  0.9  -0.8

In [42]:
df

     W    X    Y    Z  new2
A  2.7  0.6  0.9  0.5   3.6
B  0.6 -0.3 -0.8  0.6  -0.2
C -2.0  0.7  0.5 -0.5  -1.5
D  0.1 -0.7 -0.9  0.9  -0.8
E  0.1  1.9  2.6  0.6   2.7

Group by

In [43]:
import pandas as pd
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Venessa','Carl','Search'],
      'Sales':[200,120,340,124,243,350],}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB   Search    350

In [44]:
by_comp=df.groupby(["Company"])

In [45]:
by_comp

In [46]:
# เหมือนด้านบน
a = df.groupby("Company")
a.mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [47]:
by_comp.mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [48]:
df.groupby('Company').mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

Head and Tail

In [49]:
import pandas as pd
import numpy as np

In [50]:
long_series=pd.Series(np.random.randn(1000))

In [51]:
long_series.head()

0    2.706850
1    0.628133
2    0.907969
3    0.503826
4    0.651118
dtype: float64

In [52]:
long_series.tail(3)

997    0.198482
998    0.646044
999   -0.361107
dtype: float64

Concatenate

In [53]:
import pandas as pd

In [54]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                  index=[0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [55]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']},
                  index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [56]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                  'B':['B8','B9','B10','B11'],
                  'C':['C84','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']},
                  index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8  C84   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [57]:
pd.concat([df1,df2,df3])  #default คือ axis=0 เอา row มาเรียงกัน pd.concat([df,…], axis = 0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8  C84   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [58]:
pd.concat([df1,df2,df3],axis=1) # axis = 1 เป็นการเอา column มาต่อกัน ถ้าไม่มีข้อมูลจะมีการเติม NaN

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8  C84   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Mergeing

In [59]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [60]:
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [61]:
pd.merge(left,right,how='inner',on='key') # ใช้ column key เชื่อม

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Merging

In [62]:
left=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'key1':['K0','K0','K1','K2'],
                  'key2':['K0','K1','K0','K1']})
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [63]:
right=pd.DataFrame({'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3'],
                  'key1':['K0','K1','K1','K2'],
                  'key2':['K0','K0','K0','K0']})
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [64]:
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [65]:
pd.merge(left,right,how='right',on=['key1','key2']) #เอา key1 key ของ right เป็นหลัก  มาเป็นตัว join
# right join

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [66]:
pd.merge(left,right,how='left',on=['key1','key2']) #เอา key1 key ของ left เป็นหลัก  มาเป็นตัว join
# lift join

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

In [67]:
pd.merge(left,right,how='outer',on=['key1','key2']) #รวมแบบ union โดยเอา key1 key2 มา join
# ยำรวมกันหมด

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4  NaN  NaN   K2   K0   C3   D3
5   A3   B3   K2   K1  NaN  NaN

Joining

In [68]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                  index=['K0','K1','K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [69]:
right=pd.DataFrame({'C':['C0','C2','C3'],
                  'D':['D0','D2','D3']},
                  index=['K0','K2','K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [70]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [71]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3